In [1]:
data=read.csv('Data.csv')

In [2]:
data

   Country Age Salary Purchased
1  France  44  72000  No
2  Spain   27  48000  Yes
3  Germany 30  54000  No
4  Spain   38  61000  No
5  Germany 40     NA  Yes
6  France  35  58000  Yes
7  Spain   NA  52000  No
8  France  48  79000  Yes
9  Germany 50  83000  No
10 France  37  67000  Yes

# Replace na values with column average

In [3]:
# replace missing value with column average
data$Age= ifelse(is.na(data$Age),
                 ave(data$Age, FUN=function(x) mean(x, na.rm = TRUE)),
                data$Age)

In [4]:
data$Salary= ifelse(is.na(data$Salary),
                    ave(data$Salary, FUN=function(x) mean(x, na.rm=TRUE)),
                    data$Salary)

In [5]:
data

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

# Change categorical variables to numeric

In [6]:
# help(factor) for help and documentation
# Change categorical variable Country into numeric variable
data$Country=factor(data$Country,
                    levels= c('France','Spain','Germany'),
                    labels= c(1, 2, 3))
data

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 No
2  2       27.00000 48000.00 Yes
3  3       30.00000 54000.00 No
4  2       38.00000 61000.00 No
5  3       40.00000 63777.78 Yes
6  1       35.00000 58000.00 Yes
7  2       38.77778 52000.00 No
8  1       48.00000 79000.00 Yes
9  3       50.00000 83000.00 No
10 1       37.00000 67000.00 Yes

In [7]:
# Change categorical varibale Purchased into numeric varable
data$Purchased=factor(data$Purchased,
                    levels= c('No','Yes'),
                    labels= c(0,1))
data

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
6  1       35.00000 58000.00 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
9  3       50.00000 83000.00 0
10 1       37.00000 67000.00 1

# Split data into training and testing sets

In [8]:
# Split data into training and testing sets
#install.packages('caTools')
library(caTools)

Updating HTML index of packages in '.Library'
Making 'packages.html' ... done

In [9]:
set.seed(123)
split= sample.split(data$Purchased, SplitRatio= 0.8)
# TRUE goes to training, FALSE goes to test
split

 [1]  TRUE  TRUE  TRUE  TRUE  TRUE FALSE  TRUE  TRUE FALSE  TRUE

In [11]:
training_set= subset(data, split== TRUE)
test_set= subset(data, split== FALSE)
training_set

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
10 1       37.00000 67000.00 1

# Feature Scaling

In [13]:
# indexing in R is more intuitive than Python, it starts from 0 and include upper boundary
# also, to include all rows, just put ",", don't need ":"
training_set[, 2:3]= scale(training_set[, 2:3])
test_set[, 2:3]= scale(test_set[, 2:3])

In [16]:
# cmd + / to comment out and uncomment multi-lines of code
training_set
test_set

   Country Age         Salary     Purchased
1  1        0.90101716  0.9392746 0
2  2       -1.58847494 -1.3371160 1
3  3       -1.14915281 -0.7680183 0
4  2        0.02237289 -0.1040711 0
5  3        0.31525431  0.1594000 1
7  2        0.13627122 -0.9577176 0
8  1        1.48678000  1.6032218 1
10 1       -0.12406783  0.4650265 1

  Country Age        Salary     Purchased
6 1       -0.7071068 -0.7071068 1
9 3        0.7071068  0.7071068 0